app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "addres", "size", "synopsis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["addres", ""], ["size", ""], ["synopsis", ""], ["created_at", "2018-09-30 22:19:02.341679"], ["updated_at", "2018-09-30 22:19:02.341679"]]

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "zillow1"], ["updated_at", "2018-09-28 17:35:21.068692"], ["id", 2]]