app/controllers/enquiries_controller.rb

SELECT  "enquiries".* FROM "enquiries" WHERE (listing_id LIKE 4) ORDER BY "enquiries"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @enquiries = Enquiry.all

INSERT INTO "enquiries" ("subject", "message_content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @enquiry =current_user.enquiries.build(enquiry_params)

    respond_to do |format|
      if @enquiry.save

SELECT  "enquiries".* FROM "enquiries" WHERE "enquiries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_enquiry
      @enquiry = Enquiry.find(params[:id])