app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Ojas Barve"], ["phone", 9192475355], ["updated_at", "2018-09-29 00:34:48.333381"], ["id", 1]]